Revit 2024 API
PartMaker.IsSourceElement Method
 Is the element a source for this PartMaker
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsSourceElement(
	ElementId elemId
)
Visual Basic
Public Function IsSourceElement ( _
	elemId As ElementId _
) As Boolean
Visual C++
public:
bool IsSourceElement(
	ElementId^ elemId
)
Parameters
elemId
Type: Autodesk.Revit.DB.ElementId
Return Value
 Returns true if elemId is among the source elements of this PartMaker
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartMaker Class
Autodesk.Revit.DB Namespace